examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (6.283185307179586 0 0)
    (6.283185307179586 6.283185307179586 0)
    (0 6.283185307179586 0)
    (0 0 6.283185307179586)
    (6.283185307179586 0 6.283185307179586)
    (6.283185307179586 6.283185307179586 6.283185307179586)
    (0 6.283185307179586 6.283185307179586)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    down
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
);

// mergePatchPairs
// (
// );

// ************************************************************************* //
