examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object       H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4096
(
3.059429597771628e-61
4.478252572609462e-61
6.555450220131569e-61
9.597359885177380e-61
1.405463402945712e-60
2.059402226399399e-60
3.021389273318806e-60
4.444646719554119e-60
...
)
;

boundaryField
{
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
