examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/system/amgxUOptions
{
    "config_version": 2, 
    "solver": {
        "preconditioner": {
            "scope": "precond", 
            "max_iters": 1, 
            "solver": "MULTICOLOR_DILU"
        }, 
        "use_scalar_norm": 1, 
        "solver": "PBICGSTAB", 
        "print_solve_stats": 0, 
        "obtain_timings": 0, 
        "monitor_residual": 1,
        "store_res_history": 1, 
        "convergence": "RELATIVE_INI_CORE", 
        "max_iters": 20, 
        "scope": "main", 
        "tolerance": 1e-5, 
        "norm": "L2"
    }
}