examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
TGV_U  
    {
     field U; 
     expression "vector(4*sin(pos().x/0.001)*cos(pos().y/0.001)*cos(pos().z/0.001),-4*cos(pos().x/0.001)*sin(pos().y/0.001)*cos(pos().z/0.001),0)"; 
     keepPatches 1; 
    }
 );


// ************************************************************************* //
